// База данных для генератора персонажей D&D

const NAMES = [
    "Абдухи", "Адам", "Айм", "Акандас", "Алеб", "Алеранд", "Алексей", "Альтарон", "Амдир", "Амнон",
    "Ананшу", "Анна", "Аракити", "Аранхона", "Арано", "Арсу", "Атлони", "Атрею", "Авеонна", "Азог",
    "Б'нур", "Барбена", "Беллиндор", "Бидо", "Богохул", "Болонк", "Болхилд", "Больничник", "Бонк", "Броди",
    "Бу", "Валентин", "Валин", "Валлистра", "Вань", "Ваз", "Вдуить", "Весли", "Виггенс", "Владимир",
    "Влаадрик", "Волондерса", "Гарм", "Георгий", "Глим", "Гномка", "Гоголу", "Голинг", "Голомонг", "Горунн",
    "Грич", "Дамая", "Данкор", "Дасстинка", "Дейзи", "Дельзидиае", "Делдит", "Денька", "Дересияй", "Дермошрак",
    "Дестини", "Диеза", "Джарнель", "Джен'лиг", "Джим", "Джин'та", "Дорин", "Доли", "Еба", "Ева",
    "Еленна", "Ениалис", "Ёгла", "Ёнтот", "Желц", "Жифонков", "Жиндоу", "Зара", "Зар'рит", "Зонадор",
    "Зоракс", "Изера", "Илиин", "Ильва", "Ильминиск", "Ини", "Ирма", "Ир'риго", "Иш-макаль", "Йиссуне",
    "Йодили", "Йпту", "Йунгоу", "Каир", "Кар'и'нас", "Катхра", "Квил", "Кекл", "Келд", "Кементариндур",
    "Кемитонру", "Клем", "Кожеков", "Кр'рисон", "Критинайя", "Кузьма", "Кюит", "Лиана", "Лиара", "Лидди",
    "Ликус", "Лина", "Локамоли", "Луцан", "Люциан", "Мажорш", "Макария", "Мерис", "Микилла", "Миримэ",
    "Мирослав", "Молиронса", "Монка", "Моргана", "Моррин", "Налрал", "Намфудле", "Насэйлер", "Натали", "Нег",
    "Норд", "Огнебров", "Ойрхин", "Олег", "Оли", "Олодилона", "Орзаайн", "Орианна", "Отлех", "Паэлиас",
    "Палномона", "Пинзла", "Плокват", "Покрон", "Поли", "Полимох", "Помниса", "Портуонолд", "Рагорол", "Рашаа",
    "Реда", "Рианна", "Рисщынн", "Ришиндар", "Рогар", "Рунефисс", "Рундар", "Сакс", "Самоли", "Саннл",
    "Сариэль", "Сариох", "Святослав", "Селин", "Силила", "Силоха", "Сира", "Слиббердаббер", "Сомпт", "Сомра",
    "Соакош", "Стаси", "Сыгарх", "Талаш", "Тараканс", "Тевен", "Терван", "Тервароунд", "Тиа", "Толама",
    "Томарф", "Торгрим", "Торго", "Торгрис", "Тордак", "Тордек", "Торфиана", "Трейка", "Трейни", "Трубек",
    "Улла", "Умлик", "Урриона", "Урхур", "Уфтак", "Уфук", "Фаэрил", "Фаллонд", "Фелая", "Фенелзи'ир",
    "Фёрд", "Фикси", "Фили", "Финеллен", "филск", "Фобития", "Франкмингвуд", "Хакон", "Ханья", "Химо",
    "Холидеску", "Хоск", "Хурм", "Цаллыбон", "Цлаира", "Чёрмос", "Чирка", "Чоби", "Чучхек", "Шава",
    "Шая", "Шалкашлах", "Шигол", "Шишя", "Шпик", "Шракк", "Шуршу", "Щерыдд", "Эа", "Эанди",
    "Эберк", "Эвир", "Эдинганта", "Эзри", "Эленнетх", "Эллифитиль", "Эльгот", "Элирдайн", "Эрдан", "Юмпалолик",
    "Юргунн", "Яа'адок", "Яколт", "Яков", "Янго", "Янголь", "Яндоли", "Япиоль", "Яран"
];

// Структура для рас с бонусами
const RACES = {
    "Человек": {
        subraces: ["Человек"],
        bonuses: { all: 1 } // +1 ко всем характеристикам
    },
    "Эльф": {
        subraces: ["Высший эльф", "Лесной эльф", "Дроу"],
        bonuses: { dex: 2 }, // +2 к ловкости для всех эльфов
        subraceBonuses: {
            "Высший эльф": { int: 1 },
            "Лесной эльф": { wis: 1 },
            "Дроу": { cha: 1 }
        }
    },
    "Дварф": {
        subraces: ["Дварф скальный", "Дварф холмовой", "Дуэргар"],
        bonuses: { con: 2 },
        subraceBonuses: {
            "Дварф скальный": { str: 2 },
            "Дварф холмовой": { wis: 1 },
            "Дуэргар": { str: 1 }
        }
    },
    "Тифлинг": {
        subraces: ["Тифлинг"],
        bonuses: { cha: 2, int: 1 }
    },
    "Полурослик": {
        subraces: ["Полурослик легконогий", "Полурослик коренастый"],
        bonuses: { dex: 2 },
        subraceBonuses: {
            "Полурослик легконогий": { cha: 1 },
            "Полурослик коренастый": { con: 1 }
        }
    },
    "Орк": {
        subraces: ["Орк"],
        bonuses: { str: 2, con: 1}
    },
    "Драконорожденный": {
        subraces: ["Драконорожденный"],
        bonuses: { str: 2, cha: 1 }
    },
    "Гном": {
        subraces: ["Гном скальный", "Гном холмовой"],
        bonuses: { int: 2 },
        subraceBonuses: {
            "Гном скальный": { con: 1 },
            "Гном холмовой": { wis: 1 }
        }
    },
    "Полуэльф": {
        subraces: ["Полуэльф"],
        bonuses: { cha: 2 }, // +2 к харизме
        flexibleBonuses: 2 // +1 к двум другим характеристикам на выбор
    },
    "Полуорк": {
        subraces: ["Полуорк"],
        bonuses: { str: 2, con: 1 }
    }
};

// Структура для классов: равная вероятность для каждого основного класса, затем равная вероятность для подклассов
const CLASSES = {
    "Воин": ["Мастер боевых искусств", "Мистический рыцарь", "Чемпион", "Кавалерист", "Самурай", "Мистический лучник", "Рыцарь эхо"],
    "Паладин": ["Клятва преданности", "Клятва древних", "Клятва мести", "Клятва искупления", "Клятва покорения", "Клятва славы", "Клятвопреступник"],
    "Волшебник": ["Школа вызова", "Школа иллюзии", "Школа некромантии", "Школа ограждения", "Школа очарования", "Школа преобразования", "Школа прорицания", "Военная магия"],
    "Плут": ["Вор", "Убийца", "Мистический ловкач", "Дуэлянт"],
    "Жрец": ["Домен бури", "Домен войны", "Домен жизни", "Домен знаний", "Домен обмана", "Домен природы", "Домен света"],
    "Следопыт": ["Охотник", "Повелитель зверей", "Странник горизонта"],
    "Варвар": ["Путь берсерка", "Путь тотемного воина", "Путь буревестника"],
    "Колдун": ["Архифея", "Исчадие", "Великий древний", "Небожитель", "Гений", "Бессмертный", "Бездонный", "Нежить"],
    "Монах": ["Путь открытой ладони", "Путь тени", "Путь четырёх стихий", "Путь кенсэя", "Путь пьяного мастера"],
    "Бард": ["Коллегия доблести", "Коллегия знаний", "Коллегия мешей", "Коллегия очарования", "Коллегия шёпотов"],
    "Изобретатель": ["Алхимик", "Артиллерист", "Боевой кузнец", "Бронник"],
    "Чародей": ["Наследие драконьей крови", "Дикая магия", "Божественная душа", "Теневая магия"],
    "Друид": ["Круг земли", "Круг луны", "Круг снов", "Круг пастыря", "Круг плодородия", "Круг спор"]
};

const ALIGNMENTS = [
    "Законопослушный добрый", "Нейтральный добрый", "Хаотичный добрый",
    "Законопослушный нейтральный", "Истинно нейтральный", "Хаотичный нейтральный",
    "Законопослушный злой", "Нейтральный злой", "Хаотичный злой"
];

const BACKSTORIES = [
    "Артист", "Безпризорник", "Благородный", "Великаний Подкидыш", "Гильдейский Ремеслиник", "Гладиатор", "Купец Гильдии", "Моряк", "Награждённый",
    "Народный герой", "Пират", "Отшельник", "Преступник", "Прислужник", "Разорённый", "Резчик Рун", "Рыцарь", "Чужеземец", "Шарлатан", "Шпион" 
];

const CHARACTER_TRAITS = [
    "Болтливый", "Смелый", "Оптимист", "Хладнокровный", "Мстительный", "Рассудительный", "Саркастичный", "Молчаливый",
    "Душевный", "Жадный", "Честный", "Хитрый", "Вспыльчивый", "Терпеливый", "Добродушный", "Злопамятный", "Весёлый", "Меланхоличный",
    "Расчётливый", "Благородный", "Подозрительный", "Фанатичный", "Невозмутимый",
    "Упрямый", "Преданный", "Сомневающийся", "Беспечный", "Отчаянный",
    "Галантный", "Проницательный", "Благодарный", "Циничный", "Надменный", "Мечтательный", "Прагматичный",
    "Скромный", "Азартный", "Изысканный", "Пытливый", "Заботливый", "Скрытный", "Ворчливый",
    "Обаятельный", "Осмотрительный", "Надёжный",
];

const IDEALS = [
    "Свобода", "Честь", "Справедливость", "Сила", "Мудрость",
    "Богатство", "Знание", "Любовь", "Слава", "Честность",
    "Порядок", "Вера", "Жизнь", "Творчество", "Традиции", "Народ", "Уважение",
    "Служение", "Истина", "Месть", "Сострадание", "Равновесие", "Красота",
    "Общность", "Перемены", "Люди", "Ответственность", "Независимость", "Власть", "Благородный долг",
    "Сообщество", "Великодушие", "Стремление", "Всеобщее благо", "Логика", "Свободомыслие", "Сила", "Сам живи и другим не мешай", "Самопознание",
    "Команда", "Самосовершенствование", "Природа", "Нация", "Милосердие", "Креативность", "Дружба", "Искупление", "Бог",
    "Амбиции", "Миротворчество", "Безмятежность", "Искренность", "Патриотизм", "Комфорт",
    "Долг", "Процветание", "Гармония", "Чистота", "Эффективность", "Мистицизм", // УДАЛЕН ДУБЛИКАТ "Традиции"
];

const ATTACHMENTS = [
    "Семья", "Друзья", "Наставник", "Дом", "Любимое оружие",
    "Бывший возлюбленный", "Древний артефакт", "Учитель", "Боевая трофейная вещь",
    "Присяга", "Питомец", "Племя", "Гильдия", "Орден", "Книга детства",
    "Призрак прошлого", "Долг", "Деревня детства", "Загадочная личность", // ДОБАВЛЕНА ЗАПЯТАЯ!
    "Родовое знамя", "Письма близкого человека", "Любовник(ца)",
    "Мастерская", "Заложник судьбы", "Красота природы", "Кумир", "Беззащитные"
];

const WEAKNESSES = [
    "Рассеянный", "Неуклюжий", "Завистливый", "Слаб перед женщинами", "Алчный",
    "Никтофобия", "Параноидальный", "Ленивый", "Гордый", "Самоуверенный",
    "Наивный", "Суетливый", "Нервный", "Легковерный", "Мелочный",
    "Агорафобия", "Немногословный", "Ревнивый", "Акрофобия", "Клаустрофобия", "Бессрочное безумие", // ИСПРАВЛЕНО: "Агорафорбия" → "Агорафобия"
    "Аквафобия", "Хронофобия", "Сомнифобия", "Вестифобия", "Арахнофобия", "Пьяница", "Трусливый", "Курильщик",
    "Болтун", "Нытик", "Картёжник", "Ворчун", "Тщеславный"
];

// Экспортируем все данные для использования в script.js
window.characterData = {
    names: NAMES,
    races: RACES,
    classes: CLASSES,
    alignments: ALIGNMENTS,
    backstories: BACKSTORIES,
    characterTraits: CHARACTER_TRAITS,
    ideals: IDEALS,
    attachments: ATTACHMENTS,
    weaknesses: WEAKNESSES
};
